pub const ASCII = enum(u8) {
    Space = 32,
    @"0" = 48,
    @"1" = 49,
    @"2" = 50,
    @"3" = 51,
    @"4" = 52,
    @"5" = 53,
    @"6" = 54,
    @"7" = 55,
    @"8" = 56,
    @"9" = 57,
    ///分号；
    Semi = 59,
    A = 65,
    B = 66,
    C = 67,
    D = 68,
    E = 69,
    F = 70,
    G = 71,
    H = 72,
    J = 74,
    K = 75,
    M = 77,
    ///左括号[
    LeftSquare = 91,
    ///右括号]
    RightSquare = 93,
    n = 110,
    s = 115,
    u = 117,
    ///左花括号{
    LeftBraces = 123,
    ///右花括号}
    RightBraces = 125,
};
